---
kind: type
id: T:Autodesk.Revit.DB.AutomaticConnectionBehaviorType
source: html/8c50192d-a4a1-1c4d-51a4-b4c1f4e8288b.htm
---
# Autodesk.Revit.DB.AutomaticConnectionBehaviorType

Defines behavior of connector with respect to automatic creation of connections

## Syntax (C#)
```csharp
public enum AutomaticConnectionBehaviorType
```